Inception1D12Leads(
  (inceptionbackbone_1): InceptionBlock1D(
    (bottleneck): Conv1d(12, 32, kernel_size=(1,), stride=(1,), bias=False)
    (convs_conv1): Conv1d(32, 32, kernel_size=(39,), stride=(1,), padding=(19,), bias=False)
    (convs_conv2): Conv1d(32, 32, kernel_size=(19,), stride=(1,), padding=(9,), bias=False)
    (convs_conv3): Conv1d(32, 32, kernel_size=(9,), stride=(1,), padding=(4,), bias=False)
    (convbottle_maxpool): MaxPool1d(kernel_size=3, stride=1, padding=1, dilation=1, ceil_mode=False)
    (convbottle_conv): Conv1d(12, 32, kernel_size=(1,), stride=(1,), bias=False)
    (bnrelu_bn): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (bnrelu_relu): ReLU()
  )
  (inceptionbackbone_2): InceptionBlock1D(
    (bottleneck): Conv1d(128, 32, kernel_size=(1,), stride=(1,), bias=False)
    (convs_conv1): Conv1d(32, 32, kernel_size=(39,), stride=(1,), padding=(19,), bias=False)
    (convs_conv2): Conv1d(32, 32, kernel_size=(19,), stride=(1,), padding=(9,), bias=False)
    (convs_conv3): Conv1d(32, 32, kernel_size=(9,), stride=(1,), padding=(4,), bias=False)
    (convbottle_maxpool): MaxPool1d(kernel_size=3, stride=1, padding=1, dilation=1, ceil_mode=False)
    (convbottle_conv): Conv1d(128, 32, kernel_size=(1,), stride=(1,), bias=False)
    (bnrelu_bn): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (bnrelu_relu): ReLU()
  )
  (inceptionbackbone_3): InceptionBlock1D(
    (bottleneck): Conv1d(128, 32, kernel_size=(1,), stride=(1,), bias=False)
    (convs_conv1): Conv1d(32, 32, kernel_size=(39,), stride=(1,), padding=(19,), bias=False)
    (convs_conv2): Conv1d(32, 32, kernel_size=(19,), stride=(1,), padding=(9,), bias=False)
    (convs_conv3): Conv1d(32, 32, kernel_size=(9,), stride=(1,), padding=(4,), bias=False)
    (convbottle_maxpool): MaxPool1d(kernel_size=3, stride=1, padding=1, dilation=1, ceil_mode=False)
    (convbottle_conv): Conv1d(128, 32, kernel_size=(1,), stride=(1,), bias=False)
    (bnrelu_bn): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (bnrelu_relu): ReLU()
  )
  (inceptionbackbone_4): InceptionBlock1D(
    (bottleneck): Conv1d(128, 32, kernel_size=(1,), stride=(1,), bias=False)
    (convs_conv1): Conv1d(32, 32, kernel_size=(39,), stride=(1,), padding=(19,), bias=False)
    (convs_conv2): Conv1d(32, 32, kernel_size=(19,), stride=(1,), padding=(9,), bias=False)
    (convs_conv3): Conv1d(32, 32, kernel_size=(9,), stride=(1,), padding=(4,), bias=False)
    (convbottle_maxpool): MaxPool1d(kernel_size=3, stride=1, padding=1, dilation=1, ceil_mode=False)
    (convbottle_conv): Conv1d(128, 32, kernel_size=(1,), stride=(1,), bias=False)
    (bnrelu_bn): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (bnrelu_relu): ReLU()
  )
  (inceptionbackbone_5): InceptionBlock1D(
    (bottleneck): Conv1d(128, 32, kernel_size=(1,), stride=(1,), bias=False)
    (convs_conv1): Conv1d(32, 32, kernel_size=(39,), stride=(1,), padding=(19,), bias=False)
    (convs_conv2): Conv1d(32, 32, kernel_size=(19,), stride=(1,), padding=(9,), bias=False)
    (convs_conv3): Conv1d(32, 32, kernel_size=(9,), stride=(1,), padding=(4,), bias=False)
    (convbottle_maxpool): MaxPool1d(kernel_size=3, stride=1, padding=1, dilation=1, ceil_mode=False)
    (convbottle_conv): Conv1d(128, 32, kernel_size=(1,), stride=(1,), bias=False)
    (bnrelu_bn): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (bnrelu_relu): ReLU()
  )
  (inceptionbackbone_6): InceptionBlock1D(
    (bottleneck): Conv1d(128, 32, kernel_size=(1,), stride=(1,), bias=False)
    (convs_conv1): Conv1d(32, 32, kernel_size=(39,), stride=(1,), padding=(19,), bias=False)
    (convs_conv2): Conv1d(32, 32, kernel_size=(19,), stride=(1,), padding=(9,), bias=False)
    (convs_conv3): Conv1d(32, 32, kernel_size=(9,), stride=(1,), padding=(4,), bias=False)
    (convbottle_maxpool): MaxPool1d(kernel_size=3, stride=1, padding=1, dilation=1, ceil_mode=False)
    (convbottle_conv): Conv1d(128, 32, kernel_size=(1,), stride=(1,), bias=False)
    (bnrelu_bn): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (bnrelu_relu): ReLU()
  )
  (shortcut_1): Shortcut1D(
    (act_fn): ReLU(inplace=True)
    (conv): Conv1d(12, 128, kernel_size=(1,), stride=(1,), bias=False)
    (bn): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  )
  (shortcut_2): Shortcut1D(
    (act_fn): ReLU(inplace=True)
    (conv): Conv1d(128, 128, kernel_size=(1,), stride=(1,), bias=False)
    (bn): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  )
  (ap): AdaptiveAvgPool1d(output_size=1)
  (mp): AdaptiveMaxPool1d(output_size=1)
  (flatten): Flatten(start_dim=1, end_dim=-1)
  (bn_1): BatchNorm1d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (dropout_1): Dropout(p=0.25, inplace=False)
  (ln_1): Linear(in_features=256, out_features=128, bias=True)
  (relu): ReLU(inplace=True)
  (bn_2): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (dropout_2): Dropout(p=0.5, inplace=False)
  (ln_2): Linear(in_features=128, out_features=71, bias=True)
)